app/Http/Controllers/DoctorsController.php

select * from `doctors` order by `id` desc
select * from `doctors`
---
    public function index(Request $request)
    {
        $doctors = Doctors::orderBy('id', 'DESC')->get();

        if ($request->ajax()) {
            $data = Doctors::get();

select * from `departments` where `departments`.`deleted_at` is null order by `id` desc
select `name`, `id` from `genders`
---
    public function create()
    {
       $departments = Departments::orderBy('id', 'DESC')->get();
       $genders = Genders::pluck('name', 'id');