app/Http/Controllers/PatientsController.php

select `id`, `first_name`, `last_name`, `patient_no`, `registration_date` from `patients` order by `id` asc limit 20 offset 0
select count(*) as aggregate from `patients`
---
    public function index(Request $request)
    {
        $patients = Patients::select(['id', 'first_name', 'last_name', 'patient_no', 'registration_date'])->orderBy('id', 'asc')->paginate(20);

select `name`, `id` from `genders`
---
    public function create()
    {
        $genders = Genders::pluck('name', 'id')->prepend('Choose Gender', '');

select * from `patients` where `patients`.`id` = '1253' limit 1
select * from `genders` where `genders`.`id` = 3 limit 1
select * from `address` where `patient_id` = '1253' limit 1
select * from `parishes` where `parishes`.`id` is null limit 1
---
    public function summary($id){

        $patient = Patients::find($id);
        $gender = Genders::find($patient->gender_id);
        $address = Address::where('patient_id', $id)->first();
        $parish = Parish::find($patient->parish_id);